capable
competent
impossible
incapable
incompetent
possible
potential

ancient
brand-new
fledgling
new
old
"second hand"
young
plain
dizzy
chubby
fat
heavy
massive
obese
overweight
plump
anorexic
gaunt
lean
skinny
light
slim
thin
underweight
faint
hungry
dizzy
thirsty
tired
numb
numbness
tingly
queasy
bloated
parched
dessicated
starving
starved
sleepy
nauseous
able
accepting
adventurous
aggressive
ambitious
annoying
arrogant
articulate
athletic
awkward
boastful
bold
bossy
brave
bright
busy
calm
careful
careless
caring
cautious
cheerful
clever
clumsy
compassionate
complex
conceited
confident
considerate
cooperative
courageous
creative
curious
dainty
daring
dark
defiant
demanding
determined
devout
disagreeable
disgruntled
eager
efficient
embarrassed
energetic
excited
expert
fair
faithful
fancy
fighter
forgiving
free
friendly
frustrated
fun-loving
funny
generous
gentle
giving
gorgeous
gracious
grouchy
hard-working
helpful
honest
hopeful
humble
humorous
imaginative
impulsive
independent
intelligent
inventive
jealous
joyful
judgmental
keen
kind
knowledgeable
lazy
leader
light-hearted
light
likeable
lively
lovable
loving
loyal
manipulative
materialistic
mature
melancholy
merry
messy
mischievous
naive
neat
nervous
noisy
obnoxious
opinionated
organized
outgoing
Passive
patient
patriotic
perfectionist
personable
pitiful
plain
pleasant
pleasing
poor
popular
prim
proper
proud
questioning
quiet
radical
realistic
rebellious
reflective
relaxed
reliable
religious
reserved
respectful
responsible
reverent
rich
rigid
rude
sad
sarcastic
self-confident
self-conscious
selfish
sensible
sensitive
serious
short
shy
silly
simple-minded
simple
smart
stable
strong
stubborn
studious
successful
tantalizing
tender
tense
thoughtful
thrilling
timid
tireless
tolerant
tough
tricky
trusting
ugly
understanding
unhappy
unique
unlucky
unselfish
vain
warm
wild
willing
wise
witty
combustible
transparent
"power adjectives"
accessible
closed
inaccessible
open
packed
dense
sparse
poor
rich
economic
uneconomic
costly
affordable
cheap
expensive
electric
magnetic
radioactive

beautiful
ugly

female
hermaphroditic
male
neuter
alive
dead
dying
extinct
healthy
sickly
sleeping
little

close
far
high
lower
low
near
upper
weight
weigh
cotton
metallic
metal
paper
wooden
fragrant
pungent
ripe
smelly
stinky
beautiful
difficult
horrible
irrational
rational
silly
diagonal
erect
horizontal
kneeling
prone
skewed
tilted
turned
upside-down
vertical
American
eastern
French
Greek
lunar
fuzzy
invisible
visible
dutiful
illegal
illicit
legal
licit
necessary
obligatory
required
unauthorized

next
this
last
prior
adaptable
adorable
afraid
agreeable
alert
alluring
ambiguous
ambitious
amused
angry
annoyed
anxious
ashamed
bewildered
bored
boundless
brave
bright
calm
capable
charming
cheerful
coherent
comfortable
confident
confused
cooperative
courageous
credible
cultured
cynical
dangerous
dashing
dazzling
debonair
decisive
decorous
defeated
defiant
delightful
depressed
detailed
determined
diligent
discreet
disillusioned
dynamic
eager
efficient
elated
embarrassed
eminent
enchanting
encouraging
endurable
energetic
entertaining
enthusiastic
envious
erratic
evasive
excited
exclusive
exuberant
fabulous
faded
fain
fair
faithful
fanatical
fantastic
fearless
fierce
fine
finicky
flashy
flippant
forgetful
frank
frantic
fretful
friendly
frightened
funny
furtive
generous
gentle
glorious
grieving
grouchy
guarded
gullible
happy
harmonious
helpful
helpless
hesitant
hilarious
homeless
honorable
hungry
hurt
ill
impartial
industrious
instinctive
irresolute
jealous
jittery
jolly
joyous
kind
knowledgeable
lazy
level
likeable
lively
lonely
lovely
loving
lucky
materialistic
mature
modern
mysterious
naughty
nervous
nice
obedient
outrageous
painstaking
panicky
peaceful
perfect
permissive
placid
plausible
pleasant
plucky
possessive
productive
protective
proud
punctual
quiet
receptive
reflective
relieved
resolute
responsible
rhetorical
righteous
romantic
sad
scary
secretive
sedate
seemly
selective
self-assured
sensitive
shrewd
sincere
skilful
slow
smiling
sneaky
sore
splendid
squeamish
steadfast
stimulating
strict
successful
succinct
talented
tense
testy
thick-skinned
thoughtful
threatening
thrifty
tight
timid
tired
tough
troubled
trustworthy
typical
unbiased
unsure
unusual
upbeat
upset
vague
vigorous
vivacious
volatile
voracious
warm
wary
wasteful
weak
weary
willing
wise
witty
wonderful
worried
zany
zealous
middling
several
some
loud
noisy
quiet
silent
soft
high-pitched
low-pitched
acidy
acrid
aromatic
balmy
briny
burnt
damp
dank
earthy
fishy
fragrant
fresh
gaseous
heady
mildewed
moldy
musty
odorous
perfumed
piney
pungent
putrid
rancid
reeking
rotten
savory
scented
sharp
sickly
sour
spicy
spoiled
stagnant
sweet
crisp
dull
thick
thin
acicular
allantoid
amygdaloid
ancistroid
ancoral
angular
ankyroid
annodated
ansate
apsidal
arborescent
arcate
arcuate
arietinous
aspidate
auriform
baculiform
balanoid
belemnoid
beloid
belonoid
branching
broken
buccinal
cannular
cardioid
carinated
cassideous
ceratoid
choanoid
chubby
cingular
circinate
circular
clathrate
clavate
clithridiate
clustered
clypeate
cochlear
conglobate
conical
coracoid
cordate
cordiform
corniculate
coronoid
cricoid
crinkled
cubic
cubiform
cuneate
cuneiform
cupulate
curved
cylindrical
deltoid
domed
fat
flat
fucoid
furcular
galeated
globular
helicoid
helminthoid
hexagonal
hollow
hyoid
hypsiloid
ichthyomorphic
irregular
lambdoid
ligulate
lobular
lumpy
lunate
lunulate
mitrate
navicular
nephroid
olivary
omegoid
ooidal
ophiomorphic
oval
oviform
padded
palaceous
pendulous
portly
proportional
pyramidal
rectangular
rotund
round
ruffled
scalloped
square
swollen
top-heavy
triangular
tubular
tufted
wavy
winged
wiry
short
midget
low
little

Catholic
dominant
loud
noisy
quiet
silent
fast
lethargic
quick
rapid
slow
colloidal
powder
tall
lanky
gangly
high
alkaline
bitter
bittersweet
bland
burnt
buttery
cheesy
crisp
fishy
fruity
gingery
hearty
juicy
luscious
medicinal
mellow
oily
overripe
peppery
raw
ripe
rotten
salty
sour
spicy
spoiled
sugary
sweet
tangy
taste
tasty
unripe
vinegary
yummy
old
young
abrupt
evolutionary
gradual
hasty
hurried
impulsive
quick
rapid
rash
revolutionary
suddenly
sudden
swift
ancient
annually
current
former
future
historical
historic
lately
modern
monthly
new
old
past
present
yearly
young

as
than
as
behind
away
ahead
under
after
"for a while"
all
almost
badly
barely
bare
basically
beyond
brief
completely
deeply
enough
entirely
especially
exactly
exact
extremely
fairly
fully
further
halfway
hardly
heavily
high
how
just
kind
lack
lightly
little
long
lot
low
merely
mid
mostly
much
nearly
nothing
only
over
particularly
plenty
practically
pretty
quite
rather
really
scarcely
seriously
serious
short
simply
slightly
slight
somewhat
so
too
totally
under
very
within
daily
ever
habitually
monthly
steadily
times
weekly
yearly
"in no circumstances"
never
"no sooner"
"not only"
nowhere
"on no account"
"only then"
scarcely
seldom
"under no circumstance"
furlong
mile
kilometer
inch
foot
yard
centimeter
meter
lightyear
second
minute
hour
day
week
month
year
century
millenia
weekend
morning
afternoon
evening
night
semester
term
season
session
rarely
hardly
little
"at no time"
barely
"no sooner"
never
scarcely
"not only"
seldom
neither
nor
only
"not since"
"never before"
"not until"
first
fourth
second
third
before
ago
later
earlier
after
hence
before
earlier
eventually
finally
lastly
later
next
nowadays
now
soon
still
today
tomorrow
yesterday
yet
ISIS
ISIL
Daesh
"Islamic state"
regime
junta
hinkey
"fed up"
abandon
abduct
aberrant
expensive
aberration
abhor
abject
abnormal
abominable
abortion
abrasive
abrupt
abuse
abusive
abysmal
abyss
abyssal
accident
accident-prone
accost
accursed
accusatory
accuse
ache
aching
acquiesce
acquiescent
acrid
acrimonious
addict
admit
admonish
adrift
adulterate
adverse
afflict
afflicted
affront
afraid
against
age
aggravate
aggressive
aggrieve
aghast
agitate
agonize
agonized
agony
ail
aimless
alarm
alien
alienate
allege
allergic
alone
aloof
aloofness
ambiguous
ambivalent
ambush
anathema
anemic
anesthetize
angry
angst
angsty
anguish
anguished
animosity
annihilate
annoy
annoyed
annoying
antagonistic
antagonize
antiquated
antisocial
antsy
anxiety
anxious
apart
apathetic
apathy
apologetic
apoplectic
appall
appalled
appalling
appease
apprehend
apprehension
apprehensive
archaic
arduous
argue
argument
argumentative
arrest
arrogant
artificial
artless
ashamed
asinine
asocial
asphyxiate
ass
assail
assassinate
assault
atrocious
atrophy
attack
authoritarian
avaricious
avoid
away
awful
awkward
awkwardness
awry
baby
babyish
back
backward
bad
bad-tempered
badger
baffle
bait
ballistic
bamboozle
ban
banal
banish
bankrupt
barmy
barrage
barred
barren
bash
bashful
bastard
batter
"bawl out"
beastly
beaten
bedevil
bedraggle
befuddle
beleaguer
belittle
bellicose
belligerent
bellow
below
bent
berate
bereave
bereaved
bereavement
bereft
berserk
beset
besiege
besmirch
bestial
betray
bewilder
bewildered
bias
bicker
big-headed
bilious
bitch
bitchy
bite
biting
bitter
bizarre
blabber
black
blacken
blacklist
blackmail
blah
blame
bland
blasphemous
blast
bleak
bleed
blight
blind
block
blockhead
bloodthirsty
bloody
bloody-minded
blown
bludgeon
blue
blur
blurry
bluster
blustery
boastful
bogus
boil
boiling
bombard
bombastic
bone-idle
bonkers
boorish
bootlick
bore
bored
boring
bossy
botch
bother
bothersome
bottom
bound
brainwash
brash
bratty
brawl
brazen
breach
break
breed
bribe
bristle
broken
broken-down
broken-hearted
brood
brooding
broody
browbeat
brown-nose
bruise
brutal
brutality
brutalize
brutally
brute
brutish
bug
bullshit
bully
bum
burden
burdensome
burn
burned-out
bushwhack
bust
cacophony
cage
callous
callow
cancel
cancer
cannibal
cantankerous
capitulate
capitulation
capricious
captious
captive
capture
careless
carelessness
careworn
carnage
cast
castigate
catatonic
catty
caught
caustic
cautious
cavalier
censor
censure
chafe
chagrin
chain
changeable
chaotic
chastise
chatty
cheap
cheat
cheeky
cheerless
chicanery
chide
childish
chilling
choke
chubby
chump
churlish
clench
cling
clinging
clingy
clod
cloud
clouded
clueless
clumsy
clutter
coarse
cocky
coddle
codependent
coerce
cold
cold-blooded
cold-hearted
collapse
comatose
combat
combative
command
commiserate
common
commonplace
compel
complacent
complicate
compress
compulsive
compunction
con
conceit
concern
condemn
condemnation
condescend
condolence
confess
confine
conflict
confound
confront
confrontation
confuse
confused
confusion
conquer
conservative
conspicuous
conspiracy
conspiratorial
conspire
constrain
consume
contagious
contaminate
contamination
contempt
contemptible
contemptuous
contention
contentious
contradict
contradiction
contradictory
contraindicated
contrary
controversial
controversy
convalescence
convict
copy
corpulent
corrosive
corrupt
corruption
costly
counter-productive
counterfeit
covet
covetous
coward
cowardly
crabby
cramp
cranky
crap
crappy
crass
craze
crazy
credulous
creep
creepy
crestfallen
crime
criminal
cripple
critical
criticism
criticize
cross
cross-examine
crotchety
crowd
crucify
cruddy
crude
cruel
crumb
crumby
crummy
crumple
crush
crushed
cry
cuckold
cull
culpable
cumbersome
cunning
cupidity
curmudgeonly
curse
cuss
cynic
cynical
daffy
dam
damage
damn
danger
dangerous
dark
darkness
dash
daunt
daze
dead
deadlock
deafen
debase
debilitate
decadent
decay
deceit
deceitful
deceive
deception
deceptive
decimate
decline
decrepit
defame
defeat
defeated
defective
defense
defenseless
defensive
defiant
deficient
defile
deflate
deform
defy
degenerate
degradation
degrade
dehumanize
deject
dejected
delay
delete
deleterious
delinquent
delirious
delude
delusion
demand
demean
demented
demolish
demonic
demonize
demoralize
demote
demotivate
denature
denigrate
denounce
dense
deny
dependent
deplete
deplorable
deport
deprave
deprecate
depreciate
depress
depressed
deprive
deranged
deride
derisive
desecrate
desert
desiccate
desolate
despair
despairing
desperate
despicable
despise
despoil
despondent
destitute
destroy
destructive
desultory
detached
detain
deteriorate
detest
detestable
devalue
devastate
devastated
deviance
deviant
devil
devious
devoid
devour
diagnosis
dictator
dictatorial
dictatorship
differ
difficult
difficulty
diffident
diffuse
dim
diminish
dimwit
dire
directionless
dirty
disable
disaffect
disagree
disagreeable
disagreement
disappear
disappoint
disappointment
disapprove
disassociate
disassociation
disaster
disbelieve
discard
discardable
discombobulate
discomfit
discomfort
disconcert
disconnect
disconsolate
discontent
discontented
discontinue
discord
discordance
discordant
discourage
discouraged
discredit
discriminate
disdain
disdainful
disease
disembody
disempower
disenchant
disenfranchise
disfavor
disgrace
disgruntle
disgust
disgusted
disharmonious
disharmony
dishearten
disheartened
dishonest
dishonesty
dishonor
dishonorable
disillusion
disillusioned
disincentive
disincline
disingenuous
disinterest
disjoint
dislike
dislocate
dislodge
disloyal
dismal
dismay
dismayed
dismiss
dismissive
disobedient
disobey
disorder
disorderly
disorganize
disorient
disown
disparage
dispensable
displace
displease
displeased
disposable
dispossess
dispute
disqualify
disquiet
disregard
disrespect
disrespectful
disruptive
diss
dissatisfaction
dissatisfied
dissatisfy
dissent
disservice
dissident
dissimilar
dissipate
dissociate
distant
distort
distract
distraught
distress
distressed
distrust
distrustful
disturb
disturbed
disuse
diverge
divide
divorce
docile
doctrinaire
dodo
dogmatic
doleful
dollard
dolorous
dolt
doltish
dominate
domineer
domineering
doom
dope
dork
dorky
double-cross
doubt
doubtful
dowdy
down
downcast
downhearted
downtrodden
Draconian
draconian
drain
drastic
drawback
dread
dreadful
dreary
dried-up
droopy
drop
drown
drub
drunk
dry
dubious
dull
dumb
dumbfounded
dummy
dump
dunce
dupe
dysfunctional
dysphoric
eclipse
effeminate
effete
ego
egocentric
egotist
egotistic
egotistical
elderly
elitist
elusive
emasculate
embarrass
embarrassed
embezzle
embitter
emotionless
empty
encroach
encumber
endanger
endless
endure
enemy
enervate
engulf
enmesh
ennui
enrage
enraged
enslave
entomb
entrap
entrench
envious
envy
eradicate
erasable
erase
erode
err
erratic
error
escalate
estrange
estrangement
evade
evasive
evict
evil
eviscerate
exacerbate
exasperate
exasperation
excess
excessive
excessively
exclude
excommunicate
excoriate
excuse
execrate
execute
exhaust
exile
exorbitant
exorcise
experimental
exploit
exploitative
explosive
expose
expunge
external
extravagant
extreme
facetious
factious
faded
fag
fail
failure
faint
fainthearted
fake
fallen
fallible
fallow
false
falsely
falter
faltering
famine
famish
fanatical
fanciful
farcical
fat
fatalistic
fatigue
fatuous
fault
fawn
faze
fear
fearful
fearless
fed-up
feeble
fermenting
ferocious
fetter
feud
fib
fickle
fidgety
fiendish
fierce
fiery
fight
filch
filthy
finicky
fire
firestorm
fixate
flabbergast
flagellate
flagging
flaky
flamboyant
flammable
flappable
flashy
flat
flatter
flattery
flaw
fledgling
fleece
flighty
flimflam
flimsy
flip
flippant
flirtatious
flog
flounder
flummox
flunk
fluster
fluttering
foggy
fool
foolhardy
foolish
foolishness
forbidden
force
forceful
foreign
forget
forgetful
forgettable
forlorn
fornicate
fornication
forsaken
forward
foul
fouled-up
fracture
fragile
fragment
frail
frame
frantic
fraud
fraudulent
frazzle
freak
freakish
freaky
free-ride
free-riding
frenetic
frenzy
fret
fret-filled
fretful
friction
friendless
frighten
frightened
frigid
frivolous
frown
frowning
frustrate
frustrated
frustration
fuck
fume
fuming
funereal
furious
furtive
fury
fuss
fussy
futile
gag
gall
gang
gangster
garbage
garble
gauche
gaudy
gaunt
gawky
ghastly
giddy
giggly
glamorize
glare
glib
gloomy
glower
glum
gluttonous
gnaw
goad
goof
goofy
gory
grandiose
grave
greedy
grief
grief-stricken
grievance
grieve
grieved
grieving
grim
gross
grotesque
grouchy
grouse
grovel
growl
grubby
gruesome
grumpy
guarded
guilt
guilty
gullible
gushy
gut
gutless
gyp
haggard
halt
hammer
hamper
handcuff
handicap
haphazard
hapless
harangue
harass
hard-line
hard-liner
hardest
hardship
harm
Harry
harsh
harshness
hassle
hasty
hate
hateful
hatred
haughty
haunt
hazy
headstrong
heart-broken
heartache
heartbroken
heartless
heartsick
heavy
heavy-handed
heavy-hearted
heavyhearted
heckle
heinous
hell
helpless
henchman
henchmen
henpeck
hesitant
hidebound
hideous
hinder
hit
hoard
hoax
hobble
holler
hollow
homeless
homely
homesick
hoodwink
hoot
hopeless
horrendous
horrible
horrific
horrify
horror
hostage
hostile
hot-headed
hot-tempered
hotheaded
hound
howl
humbled
humiliate
humiliated
humiliation
hungry
hurry
hurt
hype
hyperactive
hypocritical
hysterical
idiot
idiotic
idle
ignoble
ignominious
ignoramus
ignorant
ignore
ill
ill-advised
ill-at-ease
ill-tempered
illegal
illegitimate
illicit
illness
imbalance
imbecile
imitation
immature
immobile
immodest
immoral
impair
impatience
impatient
impend
imperfect
imperfection
imperil
imperious
impermanent
impersonal
impersonalness
impertinent
impetuous
impious
impolite
importunate
impose
impotent
impoverish
impracticable
impractical
imprison
improbable
imprudent
impudent
impugn
impulsive
impulsiveness
impure
"in debt"
inaccessible
inaccurate
inactive
inadequate
inadvisable
inane
inappropriate
inartificial
inattentive
incapable
incapacitate
incarcerate
incense
incensed
incinerate
incoherent
incommunicative
incompetent
incomplete
incompleteness
inconceivable
inconclusive
incongruent
incongruous
inconsiderable
inconsiderate
inconsistent
inconsolable
inconspicuous
inconvenience
inconvenient
incorrect
incorrigible
incredulous
incriminate
indecent
indecision
indecisive
indefinite
indict
indifferent
indignant
indiscreet
indispose
indisposed
indoctrinate
industrial
indoctrination
indolent
inebriate
ineffective
ineffectual
inefficient
inept
inequality
inert
inexperience
inexperienced
inexplicable
infamous
infantile
infantilize
infatuate
infatuated
infect
infelicitous
inferior
infirm
inflame
inflamed
inflammatory
inflate
inflexible
inflict
infuriate
infuriated
ingenuous
ingratiate
inhibit
inhospitable
inhumane
inimical
injure
injured
injustice
innoxious
inorganic
insane
insecure
insensitive
insignificant
insincere
insistent
insolent
insolvent
insouciant
insufficiency
insufficient
insult
insurgent
interfere
interfering
interminable
interrogate
interrupt
intimidate
intolerant
intoxicate
intransigence
intransigent
introvert
introverted
intrude
intrusive
inundate
invalid
invalidate
invariable
invasion
invasive
irascible
irate
irk
irrational
irregular
irrelevant
irreligious
irresolute
irresponsible
irreverent
irritable
irritate
irritated
isolate
itchy
jackass
jaded
jail
jangle
jaundice
jealous
jealousy
jeer
jeopardize
jerk
jihad
jilt
jinx
jittery
jolt
jostle
joyless
judgmental
jumble
jumpy
junk
junky
justify
kick
kill
kinky
knacker
kooky
kowtow
lacivious
lack
lackadaisical
lackey
lacking
lackluster
lag
lambaste
lame
lament
lamentful
lamenting
lampoon
languish
late
laughable
lawsuit
lax
lazy
leak
lecherous
lecture
leer
leery
left
less
lethargic
lewd
liability
liable
libel
licentious
lie
lien
lifeless
limit
limitation
limp
listless
litigation
litigious
livid
loath
loathsome
lock
lonely
lonesome
longing
loopy
loot
lose
loser
loss
lost
loud
lousy
lout
loveless
lovesick
low
low-spirited
lower
lowly
lowness
luckless
ludicrous
lugubrious
lure
lurk
lust
lynch
Machiavellian
mad
maddening
maelstrom
mafia
maim
maladjust
malaise
malarky
malcontent
malevolent
malicious
malign
malignant
malnourish
maniacal
manic
manipulable
manipulate
manipulative
marauding
marginalize
martyr
martyrdom
masochistic
materialistic
maudlin
meager
mean
meaningless
meanness
meddle
mediocre
meek
megalomaniacal
melancholic
melancholy
melodramatic
menace
"mentally challenged"
mess
messy
miff
militant
minimize
minion
misanthropic
misapprehension
miscalculation
miscarriage
mischievous
misconceive
misconception
misconstrue
misdiagnose
miserable
miserly
misfortune
misgiving
misguided
mishandle
mishap
misinform
misinterpret
misjudge
mislead
mismanage
mismatch
misprint
misquote
misrepresent
miss
missing
misstatement
mistake
mistaken
mistreat
mistrust
mistrustful
misunderstand
misunderstanding
misunderstood
misuse
mixed-up
mock
molest
mollycoddle
money-laundering
monopolize
monster
monstrous
moody
mope
mopey
moping
moralistic
morbid
mordant
moribund
moron
moronic
morose
mortify
motherless
mourn
mournful
mud
muddle
muddy
muffle
mumble
mummify
murder
mushy
mutinous
mutiny
muzzle
mysterious
mystify
naff
nag
naive
naked
"namby pamby"
narcissistic
narrow-minded
"narrow minded"
nasty
naughty
nauseate
needle
needy
negate
negative
neglect
negligent
nervous
nervy
nettle
neurotic
niggardly
niggle
nightmare
nihilistic
nit-pick
nitwit
no
noise
noisy
non-functioning
nonexistent
nonplus
nonsense
nosey
not
nothing
nuisance
null
nullify
numb
numskull
nuts
nutty
obedience
objectify
obligate
obligation
oblige
obliterate
oblivious
obnoxious
obscene
obscure
obsequious
obsess
obsessive
obstacle
obstinate
obstruct
obvious
odd
odor
off-putting
offal
offend
offended
offense
offensive
officious
old
omission
omit
one-sided
opinionated
oppose
opposition
oppress
oppressed
ordeal
ornery
orphan
oscillate
oscillation
ostentatious
ostracize
oust
out
outdate
outdone
outlandish
outnumber
outrage
outraged
outrageous
outside
outsider
over
over-simplify
over-the-top
overanxious
overbearing
overcharge
overcome
overcontrol
overcritical
overdraft
overdrawn
overemotional
overestimate
overload
overlook
overly
overpower
overpriced
overprotect
oversensitive
oversight
overthrow
overweight
overwhelm
overwhelmed
overwork
overwrought
overzealous
owe
pacify
pain
painful
pamper
panic
panicked
panicky
paralysis
paralyze
paranoid
parasitic
parched
parsimonious
partial
passive
past-due
pathetic
patronize
patronizing
peckish
peculiar
pedantic
pedestrian
peeve
peeved
peevish
penalize
penetrate
pensive
peremptory
perfectionistic
perilous
peripheral
pernicious
perplex
persecute
persnickety
perturb
perverse
pervert
pessimist
pessimistic
pester
"petered out"
petrified
petrify
petty
petulant
phlegmatic
phony
"picked apart"
"picked on"
pierce
pigeon-hole
pillage
pinhead
piqued
pirate
piss
"pissed off"
pissy
piteous
pitiful
pitiless
pity
pixelate
placate
placebo
plague
planless
plead
pleading
pliable
pliant
plunder
plunge
podgy
pointless
poison
police
pollute
pompous
ponderous
poop
pooped
poor
poorly
possessive
postpone
pouty
poverty
power
powerless
powerlessness
precarious
precipitate
preclude
predator
predatory
prejudice
preoccupy
press
pressure
presumptuous
pretentious
prey
prisoner
prissy
probation
probationary
profane
profiteer
promiscuous
propagandistic
propagandize
prosaic
prosecute
prostitute
protest
provincial
provoke
provoked
prudish
psychopathic
psychotic
puerile
puff
puke
pulverize
pummel
punch
punish
punisher
puny
purloin
purport
pursue
pushy
pusillanimous
"put away"
"put down"
putrid
puzzle
quaint
qualmish
quandary
quarantine
quarrel
quarrelsome
quash
queasy
queer
querulous
quibble
quick-tempered
quizzical
radical
rage
rageful
raging
raid
railroad
rake
rambunctious
rancid
rankle
ransack
rant
rapacious
rape
rash
rattle
raunchy
ravage
ravenous
ravish
reactionary
ream
rebel
rebellion
rebellious
rebuff
rebuke
recalcitrant
reckless
reclusive
reduce
redundant
refuse
regiment
regress
regressive
regret
regretful
regretfully
regrettable
reject
rejectable
relapse
relentless
reluctant
reluctantly
remiss
remorse
remorseless
remote
renounce
repel
repetitious
replaceable
reprehensible
repress
reprimand
reproach
reprove
repugnant
repulse
repulsive
resent
resentful
reserved
resign
resist
restitution
restless
restlessness
restrain
restrict
retaliate
retaliatory
retard
reticent
retire
revengeful
revile
revolt
ridicule
ridiculous
rift
rigid
rile
riot
risk
risky
rob
robbery
robot-like
robotic
rot
rotten
rotund
rough
rowdy
rubbery
rubbish
rude
rueful
ruffle
ruin
run-down
"run down"
rupture
rush
ruthless
sabotage
sacrifice
sacrificial
sacrilegious
sad
sadden
sadistic
sadness
salacious
sanctimonious
sarcasm
sarcastic
scandal
scandalize
scandalous
scapegoat
scar
scarce
scarcity
scare
scary
scathe
scatter
scheme
scoff
scold
scorn
scornful
scoundrel
scowl
scrawny
scream
screw
scum
scurrilous
sear
second
second-class
second-rate
secondary
secretive
sedate
seethe
seething
seize
self-absorbed
self-absorption
self-centered
self-centred
self-conscious
self-destructive
self-hating
self-indulgent
self-loathing
self-pitying
self-righteous
self-satisfied
self-serving
selfish
senile
severe
shadow
shadowy
shaken
shaky
shallow
shame
shamed
shameful
shameless
shatter
sheep
shirk
shit
shock
shocked
shoddy
shook-up
shoot
short
short-sighted
shortage
shortchange
shortfall
shred
shrill
shrillness
shrunk
shun
shut
shy
sick
sicken
sickness
sigh
silly
simpleton
sin
sinful
sink
skanky
skeptical
skinny
skip
skittish
slack
slain
slam
slander
slanted
slap
slaughter
slave
slavery
sleazy
sleepy
slight
slipshod
slop
sloppiness
sloppy
slothful
sloven
slovenliness
slovenly
slow
sluggish
slutty
smack
small
smarmy
smartass
smash
smell
smirk
smother
smudge
smug
snap
snarky
snarl
sneaky
sneer
snob
snobbish
snobby
snoopy
snooty
snub
sock
sodden
somber
sophomoric
sordid
sore
sorrow
sorrowful
sorry
sour
spank
spartan
spastic
spat
spendthrift
spill
spillage
spineless
spinster
spiritless
spit
spiteful
spoil
spook
squabble
squander
squash
squeamish
squeeze
squelch
stagnant
stagnation
stain
stale
stalk
stalker
stammer
starve
steal
steamed-up
stench
stepped-on
stereotype
sterile
stern
stew
stiff
stifle
stigmatize
stilted
stingy
stodgy
stolid
stomp
stonewall
stop
storm
straight-laced
strain
strand
strange
strangle
stress
stricken
strict
strong
stubborn
stubbornness
stuck
stuck-up
stump
stun
stunted
stupefy
stupid
stupidity
subdue
subjugate
submissive
submit
subordinate
subservient
subversive
suck
sucker
sue
suffer
suffering
suffocate
suicidal
suicide
sulky
sullen
sully
sunk
supercilious
superficial
superficiality
superstitious
supposed
suppress
surly
surprised
surrender
susceptible
suspend
suspicious
swamp
swindle
sycophantic
tacky
tactless
tangle
tardy
tasteless
taut
tearful
tease
temperamental
tempest
tempestuous
tense
terrible
terrify
testy
thick
thick-skinned
thoughtless
threat
threaten
threatening
tiff
tight
timid
tire
tired
tiresome
toady
tokenism
torment
torn
torture
tortured
touchy
toxic
tragedy
tragic
trap
trash
travesty
trespass
trick
trickery
trifling
trouble
troubled
truculent
turmoil
turndown
typical
ugly
unable
unacceptable
unadventurous
unambitious
unavailable
unbalanced
unbroken
unceremonious
uncertain
uncivil
unclean
uncleanliness
unclear
uncomfortable
unconscious
unconsidered
uncooperative
uncover
undecided
underestimate
undergo
underpay
undesirable
undetermined
undignified
undressed
uneasy
unethical
unfair
unfavorable
unfeasible
unfit
unfortunate
unfortunately
unfounded
unfriendly
unfulfilled
unhappy
unhealthy
unhelpful
unimaginative
unimportant
uninformed
unkind
unknown
unlikely
unloved
unnoticed
unnumbered
unpaid
unpleasant
unpopular
unpredictable
unprofessional
unprofitable
unqualified
unreasonable
unredeemed
unreduced
unreliable
unruly
unsafe
unsatisfactory
unseemly
unsettled
unsound
unspoken
unstable
unsuitable
unsupported
unsure
untidy
untrue
untrustworthy
unwanted
unwarranted
unwashed
unwelcome
unworthy
upbraid
uprising
upset
uptight
useless
usury
vacant
vacillate
vague
vain
vampire
vanity
vapid
vaporous
vehement
vengeful
venomous
vicious
victimize
victimized
vile
violate
violence
violent
virulent
vitriol
vitriolic
volatile
vomit
voodoo
voracious
vulgar
vulnerable
wanting
war
warlord
wart
wary
waste
wasteful
wasteland
watchful
weak
weak-willed
weaken
weakness
weary
weight
weird
whine
whip
wicked
wild
withdrawn
without
woebegone
woeful
"worked up"
worn
worn-out
worried
worry
worst
worthless
wrathful
wretched
wrong
yucky
ability
above
absolutely
absolve
absorb
absorbent
abundance
abundant
accelerate
accept
acceptable
accessible
acclaim
acclimate
normal
endear
accommodate
accomplish
accomplishment
accountable
accurate
ace
achieve
achievement
acknowledge
active
actualize
adamant
adaptable
adept
adequate
admirable
admiration
admire
adorable
adore
adroit
advance
adventure
adventurous
advice
advocate
affable
affection
affectionate
affirm
affirmative
affluent
affordable
agape
ageless
agile
agility
aglow
agree
agreeable
agreement
ahead
aid
aim
airy
alert
alive
all-natural
all-new
Allah
allure
alluring
almighty
alright
alter
altruism
altruistic
amaze
amazing
ambassador
ambition
ambitious
amenable
amiable
amicable
amorous
amuse
amused
amusing
ancient
animate
animated
answer
anticipate
anticipation
appeal
appealing
applaud
appreciate
appreciative
approachable
appropriate
approval
approve
aquiver
ardent
aroma
arouse
art
artful
articulate
artisan
artistic
aspiration
aspire
assertive
assertiveness
assistance
associate
association
assure
astonish
astonishing
astound
astounding
astute
"at ease"
athletic
attach
attentive
attract
attraction
attractive
audacious
auspices
authentic
authenticity
authoritative
autonomous
autonomy
avenge
avid
award
aware
awe
awe-struck
awed
awesome
awestruck
balance
"balance out"
balanced
balm
balmy
banter
bargain
barter
beaming
beatific
beautiful
beauty
beckon
bedazzle
befriend
beguile
believable
belong
belonging
beloved
bemuse
benefactor
beneficent
benevolent
benign
bequest
besot
best
better
bewitch
big
big-hearted
bigger
bits
bless
blessed
blessing
bliss
blissful
blithe
bloom
blossom
bodacious
boisterous
bold
"bon vivant"
boost
botanical
bounce
bouncy
boundless
brainy
brand-new
brave
bravery
breakthrough
breathless
breathtaking
breezy
brief
bright
brilliant
brim
brisk
broad-minded
brother
bubbly
build
bullish
buoyant
buy
buzz
cajole
cake
calm
candid
canny
capable
captivate
captivating
care
carefree
careful
caress
caring
casual
cautious
celebration
center
central
cerebral
certain
champion
change
charismatic
charitable
charity
charm
charmed
charming
chaste
chatty
cheer
cheerful
cheery
cherish
chic
chipper
chivalrous
choice
chosen
chuffed
church
circumspect
civil
classic
classy
clean
cleanliness
cleanse
clear
clearheaded
clever
cleverness
close
co-creation
coach
cognizant
coherent
collaborate
colleague
color
colorful
colourful
comedic
comely
comfort
comfortable
comfy
commend
commendable
commit
commitment
communicate
communicative
community
compact
companionable
compassionate
compatible
compelling
competent
competitive
complementary
complete
complex
compliant
compliment
compose
concentrate
conciliatory
concise
concordance
conducive
conduct
confidence
confident
confirm
conform
congenial
congregation
connoisseur
conscientious
conscious
consider
considerate
consideration
consistent
console
consonance
constant
constructive
consummate
contemplative
content
contented
continual
continually
continuity
contribute
contribution
contrite
convenient
convince
convincing
convivial
convulsive
cool
cooperate
cooperation
cooperative
coordinate
coordination
copasetic
cope
cordial
correct
cost-effective
counsel
courage
courageous
courteous
courtly
coy
cozy
crafty
creamy
create
creation
creative
creativity
credential
credible
credit
crisp
cuddle
cuddly
cultivate
culture
cultured
cunning
curiosity
curious
cute
dainty
dance
dare
daring
dashing
daughter
dauntless
dazzle
dazzling
dear
debonair
debut
decent
decide
decisive
decorous
dedicate
dedicated
deep
defined
definite
delectable
deliberate
delicate
delicious
delight
delighted
delightful
deliver
deluxe
democratic
democratically
demure
dependable
depth
deserve
deserving
design
desirable
desire
desirous
detailed
determination
determine
determined
develop
devote
devoted
devout
diamond
dicker
difference
dignified
dignify
dignity
diligence
diligent
dimple
diplomacy
diplomatic
direct
disarming
discern
discerning
discipline
discount
discreet
discrete
discriminating
disentangle
dispassionate
display
distinctive
distinguish
diverse
diversification
divine
doctor
donate
done
donor
dote
dramatic
dream
dreamy
drool
durable
dutiful
dynamic
eager
early
earnest
earthy
ease
easiest
easy
easy-going
easy-on-the-eyes
easygoing
eater
ebullient
eccentric
eclectic
eco-friendly
economical
economy
ecstatic
edify
educate
education
educational
efface
effective
effervescent
efficacious
efficient
effusive
elastic
elate
elated
electrify
electronic
elegance
elegant
elevate
elite
eloquent
emancipate
embed
embrace
emerge
eminent
empathetic
empathic
empathy
emphatic
empower
enable
enamor
enchant
enchanted
enchanting
encompass
encourage
encouraging
endless
endorse
endow
endurable
endurance
endure
energetic
energize
energy
engage
engaging
engross
engrossed
enhance
enjoy
enjoyable
enjoyment
enlighten
enlightened
enliven
ennoble
enormous
enrapture
enrich
ensure
enterprising
entertain
entertaining
enthrall
enthusiastic
entice
entitle
entrance
entrepreneurial
entrust
equal
equality
equanimous
equip
equitable
eros
erudite
escape
essence
essential
establish
established
esteem
eternal
eternally
ethereal
ethical
euphoric
even-tempered
evolution
evolve
exact
exactly
excellent
exceptional
excite
excited
exciting
exclusive
exculpate
exempt
exhilarate
exhilarated
exhilaration
exonerate
exotic
expand
expandable
expansive
expectant
experience
expert
express
expression
expressive
exquisite
extensive
extol
extra
extraordinary
extricate
extrovert
extroverted
exuberant
exultant
eye-catching
fab
fable
fabulous
fain
fair
fair-minded
fairy
faith
faithful
fame
family
famous
fantabulous
fantasize
fantastic
farewell
fascinate
fascinating
fascination
fashionable
fast
fastidious
father
favor
favorite
favourite
fearless
feast
feat
feature-packed
fecund
feisty
felicitous
feminine
ferment
fertile
fervent
fervor
festive
fetch
find
fine
finesse
finest
finish
firm
first
first-class
first-rate
fit
five-star
"five star"
fizz
flair
flatter
flattering
flavorful
fledgling
flexibility
flexible
flirt
flirtatious
flourish
flourishing
flow
fluid
focus
focused
foil
fond
fondle
foolproof
forbear
forbearance
forbearing
forceful
foresight
forever
forgive
forgiven
forgiving
form
formidable
forte
forthright
fortify
fortitude
fortunate
fortune
forward
foster
fragrance
fragrant
frank
free
freedom
fresh
freshness
friend
friendly
frisky
frolicsome
frontier
frugal
fruitful
fulfill
full
fun
"fun loving"
functional
funky
funny
furnish
future
gallant
galore
galvanize
game
gather
gaze
generous
genial
genius
gentile
gentle
genuine
giddy
gift
giggle
gild
give
giving
glad
glamorous
glamour
glamourous
glee
gleeful
glitter
global
glorious
glow
glowing
go-ahead
goal
God
godly
golden
good
good-looking
good-natured
goodhearted
goodness
gorgeous
graceful
gracious
grand
grant
grateful
gratify
gratifying
gravitas
great
green
greet
gregarious
grin
groovy
ground
grounded
grown
guarantee
guide
guilt-free
guiltless
gutsy
haggle
half-price
hallow
handy
happy
happy-go-lucky
hard-working
hardworking
hardy
harmless
harmonious
harmoniousness
harmony
harness
heady
heal
health
health-conscious
healthy
heart-to-heart
hearten
heartfelt
heartily
heartwarming
hearty
heavenly
heed
heedful
help
helpful
heroic
high
high-quality
high-spirited
hilarious
hire
"hold dear"
"home cooked"
honest
honesty
honor
honorable
honourable
hope
hopeful
horny
hospitable
hospitality
hot
hug
human-centered
humane
humanitarian
humanity
humble
humility
humor
humorous
"hunky dory"
hypnosis
hypnotic
hypnotize
ideal
idealism
idealistic
idolize
illuminate
imagination
imaginative
imbue
immaculate
immortal
immune
impact
impartial
impassion
impassive
impeccable
imperturbable
impervious
impish
implacable
important
impress
impressive
incentive
incisive
incomparable
incontrovertible
incredible
inculcate
indebted
independent
indescribable
indestructible
indispensable
individual
individuality
indulge
indulgent
industrious
inexpensive
infallible
influence
influential
inform
informative
infuse
ingenious
inner
innocent
innovate
innovation
innovative
inoculate
inquire
inquisitive
insatiable
inside
inspirational
inspire
inspired
inspiring
instant
instill
instinctive
instruct
instructive
instrumental
intact
intellectual
intelligent
intense
intent
interact
interaction
interest
interesting
internal
interrelate
intimate
intrepid
intrigue
introspection
introspective
introvert
intuitive
invaluable
inventive
invigorate
invigorating
invincible
invite
involve
invulnerable
irreproachable
irresistible
jaunty
jazzed
jest
jewel
jocular
join
joke
jolly
josh
jovial
joy
joyful
joyous
jubilant
judicious
juggle
juiced
juicy
just
justice
K.O.
karma
keen
keenest
kid
kind
kind-hearted
kindhearted
kindly
kindness
kingly
kiss
kissable
knack
knightly
knockout
know-how
knowing
knowledge
knowledgeable
known
labile
laconic
languid
large-hearted
lascivious
laud
laudable
laugh
laughing
lavish
law-abiding
lead
leadership
leading-edge
learn
learned
legend
legitimate
leisure
lenient
level
level-headed
liberal
liberate
lifelike
lift
light
lighthearted
likable
like
likeable
linger
lionhearted
listen
listener
lively
local
logical
longest
looking
lovable
love
lovely
lovestruck
loving
low-cost
low-priced
loyal
loyalty
lubricious
lucid
lucky
luminary
luminescent
luminous
luscious
lush
lustful
lusty
luxe
luxurious
macho
magic
magical
magnanimous
magnetic
magnificent
magnify
majestic
make
malleable
manage
manageable
management
managerial
manifest
manly
mannered
manners
marriage
marry
marshall
marvellous
marvelous
masculine
massage
masterful
masterly
mastermind
mastery
matchless
maternal
mature
maxi
meaningful
mediation
meditative
meld
mellow
melodious
melodiousness
memorable
memory
mentor
mentorship
merciful
meritorious
merry
mesmerize
methodical
meticulous
mighty
mild
mile-marker
milepost
milestone
mindful
miracle
miraculous
mirthful
mischievous
mission
mobilize
moderate
modern
modest
modify
mold
mollify
money-making
moral
more
mother
motherly
motivate
mouthwatering
move
moved
movement
multi
multidimensional
munchy
muse
music
musical
mysterious
mystic
mystical
myth
naked
natural
naturalness
nature
near
neat
neatness
necessary
need
negotiate
neighborhood
neighborly
nestle
new
next-generation
nice
nifty
nimble
ninja
noble
nonchalant
normality
nostalgic
notice
nourish
nourishing
novel
nude
nudge
nurse
nurture
nutritious
nuzzle
O.K.
obedient
obey
objective
objectivity
observant
observe
occasion
ogle
OK
okay
oligarch
omnipotent
one-of-a-kind
open
open-minded
open-mindedness
open-source
openhanded
openheartedness
opportunistic
opportunity
optimist
optimistic
optional
opulent
order
orderliness
orderly
organic
organize
original
originality
originate
outgoing
outgoingness
outlast
outside
outspoken
outstanding
overcome
overjoyed
painstaking
palate
palatial
pamper
paradise
pardon
participate
partner
partnership
party
passionate
pastoral
patience
patient
patriotism
patronage
peace
peaceful
peacemaking
peachy
peak
pearl
peerless
peppy
perceptive
perfect
perfection
perform
performance
perky
permanent
perseverance
persistent
personable
perspicuous
persuade
persuasive
pert
pertinent
pet
philanthropic
philosophical
philosophy
pick-me-up
pilgrimage
pioneer
pioneering
pious
placid
plan
plausible
play
playful
pleasant
please
pleased
pleasing
pleasure
plenitude
plenty
plethora
plucky
plum
plump
plus
plush
poem
poetic
poise
polish
polished
polite
popular
popularity
portable
portentous
positive
potent
power
powerful
practical
pragmatic
praise
praiseworthy
pray
precious
precise
precision
precocious
prefer
premier
premium
prepare
preppy
president
prestige
pretty
priceless
pride
prim
primal
primary
prime
pristine
privilege
privileged
prize
prize-winning
pro-active
proactive
prodigal
prodigious
productive
professional
professionalism
proficient
profitable
profound
progress
progressive
prolific
promise
promising
promote
promotion
promotional
prompt
propel
proper
proprietary
prosper
prosperity
prosperous
protect
protection
protective
proud
provident
provocative
prudent
psyched
psychedelic
public-spirited
"pumped up"
punctual
pure
purify
purity
purposeful
qualify
quality
quantity
quench
quest
quick
quick-witted
quiescent
quiet
quirky
quivery
quixotic
rad
radiant
rainbow
raise
rapid-action
rapt
rapture
rapturous
rare
rational
ravishing
raw
re-energize
reachable
ready
real
realistic
reap
reason
reasonable
reassure
rebate
reborn
rebound
reception
receptive
receptivity
recognize
recommend
recommendation
reconcile
recoup
recover
recruit
recycle
redeem
redesign
refine
refined
refinement
reflective
reform
refresh
refreshing
refuel
regain
regular
regularity
rehabilitate
reinforce
reinvented
rejoice
rejoicing
rejuvenate
relationship
relax
relaxed
release
relevance
relevant
reliable
reliant
relief
relieve
relieved
remarkable
remedy
remember
remind
remorseful
renew
renown
repentant
replenish
reposed
reputation
request
rescue
reserved
resilient
resolute
resolve
resourceful
respect
respectable
respectful
resplendent
responsible
responsive
rest
restful
restive
restrained
restructure
reunite
reuse
reveal
revelation
revere
reverent
revisit
revitalize
revive
revolutionary
reward
rewarding
rhetorical
rich
right
righteous
rigorous
riveted
robust
rock
romance
romantic
romp
rosy
royal
safe
safety
sagacious
sage
saintly
salute
samurai
sanctify
sane
sanguine
sapient
sardonic
sassy
sate
satiate
satisfaction
satisfied
satisfy
saucy
save
savor
savvy
scalable
scholarly
scientific
scintillate
scores
scrutinize
search
searching
secret
secure
security
sedate
seduce
seductive
seemly
select
selective
self-assured
self-confident
self-denying
self-determination
self-disciplined
self-expression
self-motivated
self-reliance
self-reliant
self-satisfied
selfless
sensational
sensible
sensitive
sensitivity
sensual
sensuous
sentient
sentimental
serenade
serendipitous
serene
serenity
serious
serve
service
set
settle
sexually
sexy
shapely
share
sharp
sheer
shelter
shield
shrewd
shy
significant
silent
silly
silver
simple
simplify
sincere
sing
singular
sister
sizzle
skilful
skill
skillful
slick
slug
sly
smart
smashing
smile
smiling
smitten
smooth
snuggle
soar
sociable
social
soft
soft-spoken
solar
sole
solicit
solid
son
soon
sooth
soothe
sophisticated
soulful
sound
soundness
spacious
spaciousness
spare
sparkle
sparkling
special
spectacular
speed
speedy
spellbind
spellbound
spice
spicy
spirit
spirited
spiritual
splendid
splendiferous
sponsorship
spontaneity
spontaneous
spotless
sprightly
sprite
spruce
spry
spunky
stable
staggering
stalwart
star
state-of-the-art
steadfast
steady
stimulate
stimulating
stimulation
stout
"stout hearted"
straightforward
strategic
strategy
strength
strengthen
strive
stroke
strong
strong-willed
studious
stunning
stupendous
stylish
suave
sublime
substantial
subtle
succeed
success
successful
succinct
succulent
sugar
suggest
suitable
sumptuous
sumptuousness
sun
sunny
sunshine
super
superb
superior
superlative
supersede
supersonic
supervise
supervisory
support
supportive
supreme
sure
surpass
surprise
surreal
sweet
swell
symmetrical
sympathetic
sympathize
sympathy
symphony
systematic
tactful
talent
talented
tan
tangible
tangy
tasteful
tasty
teach
tease
technology
tempting
tenacious
tender
"tender hearted"
tenderhearted
terrific
thank
thankful
"the yoke of"
theme
thin
thorough
thoroughbred
thoughtful
thoughtfulness
thrifty
thrill
thrilled
thrive
tickle
tidy
timeless
tingle
tiny
toast
tolerance
tolerant
top
totally
touch
touched
tough
toward
tradition
traditional
train
tranquil
transcend
transformation
travel
treasure
treat
treaty
tremendous
trendy
tribute
triumph
triumphant
true
truly
trust
trusting
trustworthy
truth
truthful
"turned on"
tutor
ubiquitous
ubiquity
ultimate
ultra
unafraid
unassuming
unbeatable
unbiased
unblemished
unbreakable
undeniable
undeniably
understand
understanding
understood
undoubtedly
uninterrupted
unique
unite
unity
universal
unlock
unparalleled
unquestionably
unrivaled
unrivalled
unshackled
unshakable
unsparing
unsurpassed
unusual
up
upbeat
upgrade
uplifted
upright
usability
usable
use
useful
V.I.P.
valiant
valid
valuable
value
vanish
vary
venture
versatile
versatility
vest
vibrant
victor
victory
vigorous
vindicate
vintage
virile
virtue
virtuous
vision
visionary
visit
vital
vivacious
vivid
voluntarily
voluntary
volunteer
warm
warm-hearted
warmhearted
warrior
waterproof
wealth
welcome
well
well
well-being
well-deserved
well-rounded
well-trained
wellness
whimsical
whisper
white
whiz
whole
wholesale
wholesome
whopper
willing
win
wink
winner
winsome
wise
wish
wishful
wistful
witty
wonder
wonderful
wondrous
worldly
worth
worthy
wow
write
yearn
yes
yield
young
youthful
Yule
zany
zeal
zealous
zest
zestful
"adjacent to"
beside
"next to"
north
south
east
west
northeast
northwest
southeast
southwest
"in front of"
before
ahead
within
inside
in
on
outside
above
over
higher
"on top of"
aboard
above
across
affor
afore
ahead
around
atop
"back of"
before
behind
below
beneath
beside
beyond
cross
down
higher
in
"in back"
"in back of"
"in between"
"in front of"
inside
"inside of"
lower
near
"near to"
on
"on the other side of"
"on the side of"
"on top of"
opposite
"out of"
"outboard of"
outside
"outside of"
over
"short of"
"this side of"
"to the left of"
"to the right of"
under
underneath
up
"up against"
within
north
south
east
west
